DataProcessors/ФормированиеРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеРаспределения</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реестр</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/Реестр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Реестр</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПривязкаСотрудник</xr:Item>
				<xr:Item>AccumulationRegister.БалансДолжников</xr:Item>
				<xr:Item>InformationRegister.НачальныеДанныеДоговора</xr:Item>
				<xr:Item>InformationRegister.ПланированиеКонтактов</xr:Item>
				<xr:Item>InformationRegister.ДатыУчетаДоговоров</xr:Item>
				<xr:Item>InformationRegister.СтатусыДолжников</xr:Item>
				<xr:Item>InformationRegister.ДанныеДоговоров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометитьКакНовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЗадолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПросроченныеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПросроченныйОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неустойка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Госпошлина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРасчетаЗадолженности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбработанФССП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатЗапросаВФССП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписанВРегистр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ФормированиеРаспределения/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период = ТекущаяДатаСеанса();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РаспределитьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ДобавитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьНаСервере()
	//Устанавливаем все реестры, для которых нужна выборка
	ВсеРеестры = Ложь;
	Если Реестры.Количество() = 0 Тогда
		Если Банки.Количество() = 0 Тогда
			ВсеРеестры = Истина;
		Иначе
			ЗапросРеестров = Новый Запрос;
			ЗапросРеестров.Текст = "ВЫБРАТЬ
			                       |	Реестр.Ссылка
			                       |ИЗ
			                       |	Документ.Реестр КАК Реестр
			                       |ГДЕ
			                       |	Реестр.ДатаВозврата >= &Период
			                       |	И Реестр.ДатаПередачи <= &Период
			                       |	И Реестр.Проведен = ИСТИНА
			                       |	И Реестр.Банк В (&Банк)";
			ЗапросРеестров.УстановитьПараметр("Период", Банки);
			ЗапросРеестров.УстановитьПараметр("Банки", Банки);
			
			ВыгрузкаРезультата = ЗапросРеестров.Выполнить().Выгрузить();
			Реестры.Загрузить(ВыгрузкаРезультата);
		КонецЕсли;
	КонецЕсли;
	
	ОтборПоСтатусу = (Статусы.Количество() > 0);
	ОтборПоСотруднику = (Сотрудники.Количество() > 0);
	
	ВремТЗ = Новый ТаблицаЗначений;
	ВремТЗ.Колонки.Добавить("Реестр",);
	ВремТЗ.Колонки.Добавить("Сотрудник",);
	ВремТЗ.Колонки.Добавить("Статус",);
	
	Если ОтборПоСотруднику Тогда
		Для Каждого ТекСтр Из Сотрудники Цикл
			Если ВсеРеестры Тогда
				НовСтр = ВремТЗ.Добавить();
				НовСтр.Реестр = Документы.Реестр.ПустаяСсылка();
				НовСтр.Сотрудник = ТекСтр.Сотрудник;
			Иначе
				Для Каждого ТС Из Реестры Цикл
					НовСтр = ВремТЗ.Добавить();
					НовСтр.Реестр = ТС.Реестр;
					НовСтр.Сотрудник = ТекСтр.Сотрудник;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла
	Иначе
		Если ВсеРеестры Тогда
			НовСтр = ВремТЗ.Добавить();
			НовСтр.Реестр = Документы.Реестр.ПустаяСсылка();
			НовСтр.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
		Иначе
			Для Каждого ТС Из Реестры Цикл
				НовСтр = ВремТЗ.Добавить();
				НовСтр.Реестр = ТС.Реестр;
				НовСтр.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		
	
	Если ОтборПоСтатусу Тогда
	ТЗ_2 = ВремТЗ.Скопировать();
	ВремТЗ.Очистить();
		Для Каждого ТекСтр Из Статусы Цикл
			Для Каждого ТС Из ТЗ_2 Цикл
				НС = ВремТЗ.Добавить();
				НС.Реестр = ТС.Реестр;
				НС.Сотрудник = ТС.Сотрудник;
				НС.Статус = ТекСтр.Статус;
			КонецЦикла;
		КонецЦикла;
	Иначе
		ВремТЗ.ЗаполнитьЗначения(Справочники.Статусы.ПустаяСсылка(), "Статус");
	КонецЕсли;
	
	Отбор = Новый Структура("Реестр,Статус");
	
	ПараметрыРаспределения = Объект.ПараметрыРаспределения.Выгрузить();
	
	Для Каждого ТекСтр Из ВремТЗ Цикл
		НовСтр = ПараметрыРаспределения.Добавить();
		НовСтр.Реестр = Текстр.Реестр;
		НовСтр.Сотрудник = текстр.сотрудник;
		НовСтр.Статус = ТекСтр.Статус;
		НовСтр.Приоритет = Приоритет;
	КонецЦикла;
	
	Для Каждого ТекСтр Из ПараметрыРаспределения Цикл
		//Удалим из ТЧ те строки, что уже имеются.
		СЗСтатус = ТекСтр.Статус;
		СЗРеестр = ТекСтр.Реестр;
		
		Отбор.Вставить("Статус",СЗСтатус);
		Отбор.Вставить("Реестр",СЗРеестр);
		
		НайденныеСтроки = ПараметрыРаспределения.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() > 1 Тогда
			Для сч = 1 По НайденныеСтроки.Количество() - 1 Цикл
				ПараметрыРаспределения.Удалить(НайденныеСтроки.Получить(сч));
			КонецЦикла;
		КонецЕсли;
		
		Отбор.Вставить("Статус",Справочники.Статусы.ПустаяСсылка());
		НайденныеСтроки = ПараметрыРаспределения.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 1 Тогда
			Для сч = 1 По НайденныеСтроки.Количество() - 1 Цикл
				ПараметрыРаспределения.Удалить(НайденныеСтроки.Получить(сч));
			КонецЦикла;
		КонецЕсли;
		
		Отбор.Вставить("Реестр",Документы.Реестр.ПустаяСсылка());
		Отбор.Вставить("Статус",СЗСтатус);
		НайденныеСтроки = ПараметрыРаспределения.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 1 Тогда
			Для сч = 1 По НайденныеСтроки.Количество() - 1 Цикл
				ПараметрыРаспределения.Удалить(НайденныеСтроки.Получить(сч));
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Объект.ПараметрыРаспределения.Загрузить(ПараметрыРаспределения);
КонецПроцедуры
